<template>
  <div class="dashboard-container">
    <h1 style="color:red">点击左侧菜单选择相应的功能</h1>
    <h2>我也不知道仪表盘放点什么好,但是又不能空着</h2>
    <h2>那就把大作业要求放上来吧</h2>
    <p>
      题目：在线教学管理系统（在线课程学习平台）
      概念：参照大多数在线教学网站或慕课网站，为某一公司设计一个方便、实用的在线课程学习平台。该平台主要用于管理和向用户发布公司所有版权的相应学习资料（包括视频、PDF版本讲义等）。
      具体要求：
      （1）可基于浏览器或手机端访问和管理，至少选择一种。
      （2）系统角色：课程资料管理员、公司领导、系统管理员、普通用户。
      （3）基本功能：
      注册：普通用户可以注册网站会员，得到相应用户名和密码。
      在线学习：会员登陆后，可以学习所有教学课程（包括查看某课程教学大纲、下载某一章节PDF讲义和在线观看某一章节教学视频等）。
      学习评论：会员可以在学习某个课程的某一章节后，对该章节进行以相互交流为目的的积极评论，供其他会员学习查看。
      课程信息管理：课程信息包括课程大纲（分为哪些章节，哪些内容，注意各章节的关系如何保存）以及课程摘要信息（比如：授课老师姓名和该课程属于哪一个类别的课程等等），课程资料管理员可以新增、修改或删除课程信息，以及将课程分类。
      课程资料管理：课程资料包括视频资源和PDF讲义资源，课程资料管理员可以针对某个课程的某一章节新增、修改或删除相关课程资料。
      系统管理功能：管理课程类型、冻结某个用户（可能有不可写评论）等。系统管理员负责。
      统计功能：课程信息按类型统计、课程教学视频按查看次数统计。该功能只能由公司领导使用。
      （4）加分功能：
      应用即可基于浏览器，也可基于手机端使用。（完成两端基本功能开发，即得优秀）
      会员评论需要管理员审核后才能显示。
      统计功能使用报表实现。
      系统日志管理查看功能，每一步操作都生成相应日志。
      系统使用帮助功能，会员登录后可以查看系统使用帮助信息。
      系统部分使用NoSql数据库存储非结构化数据，如：PDF讲义、教学视频等。
    </p>
  </div>
</template>

<script>
import { mapGetters } from 'vuex'

export default {
  name: 'Dashboard',
  computed: {
    ...mapGetters([
      'name',
      'roles'
    ])
  }
}
</script>

<style rel="stylesheet/scss" lang="scss" scoped>
.dashboard {
  &-container {
    margin: 30px;
  }

  &-text {
    font-size: 30px;
    line-height: 46px;
  }
}
</style>
